bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21G16A.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="4.0.1.1" caption="Non-Volatile Fuses">
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" size="4" rw="R" caption="OTP5 Page Word 0">
          <bitfield name="ADC0_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC0_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="ADC1_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x1C0"/>
          <bitfield name="ADC1_BIASCOMP" caption="ADC Comparator Scaling" mask="0xE00"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="TSENS_TCAL" caption="Temperature Calibration" mask="0x3F"/>
          <bitfield name="TSENS_FCAL" caption="Frequency Calibration" mask="0xFC0"/>
          <bitfield name="TSENS_GAIN_0" caption="Gain Calibration bits 19:0" mask="0xFFFFF000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="TSENS_GAIN_1" caption="Gain Calibration bits 23:20" mask="0xF"/>
          <bitfield name="TSENS_OFFSET" caption="Offse Calibration" mask="0xFFFFFF0"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0" initval="0xB0008877">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7" values="NVMCTRL_BOOTPROT"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70" values="NVMCTRL_EEPROM_SIZE"/>
          <bitfield name="BODVDDUSERLEVEL" caption="BODVDD User Level" mask="0x3F00"/>
          <bitfield name="BODVDD_DIS" caption="BODVDD Disable" mask="0x4000" values="BODVDD_DIS"/>
          <bitfield name="BODVDD_ACTION" caption="BODVDD Action" mask="0x18000" values="BODVDD_ACTION"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000" values="WDT_ENABLE"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000" values="WDT_ALWAYSON"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000" values="WDT_PER"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1" initval="0xFFFF00BB">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF" values="WDT_WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0" values="WDT_PER"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100" values="WDT_WEN"/>
          <bitfield name="BODVDD_HYST" caption="BODVDD Hysterisis" mask="0x200" values="BODVDD_HYST"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <value-group name="USER_FUSES_NVMCTRL__BOOTPROT">
        <value name="0" caption="0 Bytes" value="0x7"/>
        <value name="512" caption="512 Bytes" value="0x6"/>
        <value name="1K" caption="1024 Bytes" value="0x5"/>
        <value name="2K" caption="2048 Bytes" value="0x4"/>
        <value name="4K" caption="4096 Bytes" value="0x3"/>
        <value name="8K" caption="8192 Bytes" value="0x2"/>
        <value name="16K" caption="16384 Bytes" value="0x1"/>
        <value name="32K" caption="32768 Bytes" value="0x0"/>
      </value-group>
      <value-group name="USER_FUSES_NVMCTRL__EEPROM_SIZE">
        <value name="0" caption="0 Bytes" value="0x7"/>
        <value name="256" caption="256 Bytes" value="0x6"/>
        <value name="512" caption="512 Bytes" value="0x5"/>
        <value name="1K" caption="1024 Bytes" value="0x4"/>
        <value name="2K" caption="2048 Bytes" value="0x3"/>
        <value name="4K" caption="4096 Bytes" value="0x2"/>
        <value name="8K" caption="8192 Bytes" value="0x1"/>
        <value name="16K" caption="16384 Bytes" value="0x0"/>
      </value-group>
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
        <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
