bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21G16A.atdf
        <register name="WINUT" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Upper Threshold Register">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFFFF"/>
        </register>
        <register name="GAIN" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Gain Register">
          <bitfield name="GAIN" caption="Time Amplifier Gain" mask="0xFFFFFF"/>
        </register>
        <register name="OFFSET" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Offset Register">
          <bitfield name="OFFSETC" caption="Offset Correction" mask="0xFFFFFF"/>
        </register>
        <register name="CAL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Calibration Register">
          <bitfield name="FCAL" caption="Frequency Calibration" mask="0x3F"/>
          <bitfield name="TCAL" caption="Temperature Calibration" mask="0x3F00"/>
        </register>
        <register name="DBGCTRL" offset="0x24" rw="RW" size="1" initval="0x00" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="TSENS_CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0"/>
        <value name="ABOVE" caption="VALUE greater than WINLT" value="1"/>
        <value name="BELOW" caption="VALUE less than WINUT" value="2"/>
        <value name="INSIDE" caption="VALUE greater than WINLT and VALUE less than WINUT" value="3"/>
        <value name="OUTSIDE" caption="VALUE less than WINLT or VALUE greater than WINUT" value="4"/>
        <value name="HYST_ABOVE" caption="VALUE greater than WINUT with hysteresis to WINLT" value="5"/>
        <value name="HYST_BELOW" caption="VALUE less than WINLST with hysteresis to WINUT" value="6"/>
      </value-group>
    </module>
    <module name="WDT" id="U2251" version="1.0.1" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="WDT_CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="WDT_CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="WDT_EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Busy" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="Always-On Busy" mask="0x8"/>
          <bitfield name="CLEAR" caption="Clear Busy" mask="0x10"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="WDT_CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
